{"sample_idx": 212, "question_id": "gsm8k_212", "document": "", "question": "Jennifer is building tanks to hold her goldfish. She built 3 tanks that will hold 15 fish each, heated, and filled them. She plans to build the rest of the tanks equipped with heaters, and they will hold 10 fish each. If she needs to build enough tanks to house a total of 75 fish, how many more will she need to build?", "responses": ["To solve the problem, let's follow these steps:\n\n1. First, we calculate the total capacity of the tanks Jennifer has already built. \n   She built 3 tanks that hold 15 fish each, so their total capacity is: \n   3 * 15 = 45 fish\n\n2. Since Jennifer wants a total capacity of 75 fish, and she already has 45, she needs to add capacity for 75 - 45 = 30 fish.\n\n3. The new tanks she will build will hold 10 fish each. To find out how many tanks she needs to build, we divide the capacity she still needs by the capacity of each new tank:\n   30 / 10 = 3\n\nTherefore, Jennifer needs to build 3 more tanks to accommodate the remaining fish. \n\n#### 3", "Let's break down the problem step by step:\n\n1. Jennifer already built 3 tanks that can hold 15 fish each. \n   Number of fish already accommodated: 3 * 15 = 45\n   Remaining fish to be accommodated: 75 - 45 = 30\n\n2. Jennifer will build the rest of the tanks that will hold 10 fish each. \n   Number of fish per tank: 10\n   Remaining fish to be accommodated: 30\n\n3. To find out how many tanks Jennifer needs to build, we divide the remaining fish by the number of fish per tank:\n   Number of tanks needed: 30 / 10 = 3\n\nSo, Jennifer needs to build 3 more tanks. \n\n#### 3"], "matched_boxed": ["3", "3"], "ground_truth_answer_raw": "3", "step_by_step": false, "num_responses": 2}
{"sample_idx": 933, "question_id": "gsm8k_933", "document": "", "question": "A group of people contains men, women, and children. The number of men is twice the number of women, and the number of women is 3 times the number of children. If the number of children is 30, how many people does this group contain?", "responses": ["Let's break it down step by step:\n\n1. Given the number of children is 30.\n2. The number of women is 3 times the number of children:\n   Women = 3 * Children\n   Women = 3 * 30\n   Women = 90\n3. The number of men is twice the number of women:\n   Men = 2 * Women\n   Men = 2 * 90\n   Men = 180\n4. The total number of people is the sum of men, women, and children:\n   Total people = Men + Women + Children\n   Total people = 180 + 90 + 30\n   Total people = 300\n\n#### 300", "Let's break down the problem step by step.\n\nGiven:\n- Number of children (C) = 30\n- Number of women (W) = 3 * Number of children\n- Number of men (M) = 2 * Number of women\n\nStep 1: Calculate the number of women (W).\nW = 3 * C\nW = 3 * 30\nW = 90\n\nStep 2: Calculate the number of men (M).\nM = 2 * W\nM = 2 * 90\nM = 180\n\nStep 3: Calculate the total number of people in the group.\nTotal people = Number of men + Number of women + Number of children\nTotal people = 180 + 90 + 30\nTotal people = 300\n\n#### 300"], "matched_boxed": ["300", "300"], "ground_truth_answer_raw": "300", "step_by_step": false, "num_responses": 2}
{"sample_idx": 153, "question_id": "gsm8k_153", "document": "", "question": "Jim is a maintenance worker at a pool. Every time someone jumps in the pool, they cause 400 ml of water to splash out and evaporate. Jim has to get everyone out of the pool, clean, and refill it when it gets below 80% full. If the pool holds 2000 L of water, how many times can people jump in the pool before Jim has to clean it?", "responses": ["To find the number of times people can jump in the pool, we need to determine the amount of water that can be lost before it gets below 80% full.\n\nThe pool holds 2000 L of water, and 80% of that is:\n2000 L * 0.8 = 1600 L\n\nSo, the pool can lose 2000 L - 1600 L = 400 L of water before it gets below 80% full.\n\nSince 1 L = 1000 ml, the pool can lose 400 L * 1000 ml/L = 400,000 ml of water before Jim has to clean it.\n\nEach time someone jumps in the pool, 400 ml of water splashes out and evaporates. Therefore, the number of times people can jump in the pool before Jim has to clean it is:\n400,000 ml / 400 ml = 1000\n\n#### 1000", "To find out how many times people can jump in the pool before Jim has to clean it, we need to calculate the amount of water lost and the percentage of the pool's capacity that is allowed to be lost.\n\nFirst, we'll convert the pool's capacity to milliliters. Since 1 L = 1000 ml, \n2000 L = 2000 * 1000 ml \n= 2,000,000 ml.\n\nThe pool is considered empty when it's below 80% full. \n80% of 2,000,000 ml = 0.8 * 2,000,000 \n= 1,600,000 ml.\n\nSince Jim has to clean the pool when it gets below 80% full, the pool will be emptied when it has \n2,000,000 - 1,600,000 \n= 400,000 ml of water left.\n\nNow, we need to find out how many 400 ml losses it will take to get down to 400,000 ml. \nTo do that, we'll divide 400,000 by 400.\n\n400,000 / 400 \n= 1000\n\nSo, people can jump in the pool 1000 times before Jim has to clean it.\n\n#### 1000"], "matched_boxed": ["1000", "1000"], "ground_truth_answer_raw": "1000", "step_by_step": false, "num_responses": 2}
{"sample_idx": 229, "question_id": "gsm8k_229", "document": "", "question": "A man drives 60 mph for 3 hours.  How fast would he have to drive over the next 2 hours to get an average speed of 70 mph?", "responses": ["To find the total distance the man needs to travel in 5 hours to get an average speed of 70 mph, we can use the formula for average speed: \n\nAverage speed = Total distance / Total time\n\nWe want an average speed of 70 mph over 5 hours, so:\n\nTotal distance = Average speed * Total time\nTotal distance = 70 * 5\nTotal distance = 350 miles\n\nSince the man already drove 60 mph for 3 hours, we need to find the distance he traveled in the first 3 hours:\n\nDistance = Speed * Time\nDistance = 60 * 3\nDistance = 180 miles\n\nNow, we need to find the distance he needs to travel in the next 2 hours to cover the remaining distance:\n\nRemaining distance = Total distance - Distance already traveled\nRemaining distance = 350 - 180\nRemaining distance = 170 miles\n\nSince he has to cover this remaining distance in 2 hours, we can find his required speed:\n\nSpeed = Distance / Time\nSpeed = 170 / 2\nSpeed = 85 mph\n\n#### 85"], "matched_boxed": ["85"], "ground_truth_answer_raw": "85", "step_by_step": false, "num_responses": 1}
{"sample_idx": 908, "question_id": "gsm8k_908", "document": "", "question": "A restaurant buffet has 36 different dishes available to try. The restaurant features mango salsa on three of its dishes, fresh mangoes in a sixth of its dishes, and mango jelly in one dish. Oliver despises mangoes and won't eat them, but can pick them out of two of the dishes with fresh mango that he would be willing to try. How many dishes are left for Oliver on the buffet?", "responses": ["To find the number of dishes left for Oliver on the buffet, we need to first determine the total number of dishes that contain mangoes and subtract that from the total number of dishes available.\n\n1. Mango salsa dishes: 3\n2. Fresh mango dishes: Since a sixth of the dishes contain fresh mangoes, we need to find a sixth of 36. \n   A sixth of 36 = (1/6) * 36 = 6\n3. Mango jelly dish: 1\n\nTotal dishes with mangoes = 3 (salsa) + 6 (fresh mango) - 2 (dishes with mango Oliver can eat) + 1 (mango jelly) \n                           = 8\n\nNow, subtract the total number of dishes with mangoes from the total number of dishes available to Oliver.\nTotal dishes available to Oliver = Total dishes available - Total dishes with mangoes\n                                 = 36 - 8\n                                 = 28\n\nTherefore, the number of dishes left for Oliver on the buffet is:\n#### 28", "To find the number of dishes left for Oliver, we first need to determine the total number of dishes that contain mangoes and subtract that from the total number of dishes available.\n\n1. Total number of dishes with mango salsa: 3\n2. Total number of dishes with fresh mangoes: Since a sixth of the dishes have fresh mangoes, we can find this number by dividing the total number of dishes by 6.\n   Total number of dishes with fresh mangoes = 36 / 6 = 6\n\nHowever, since Oliver can pick the mangoes out of two of these dishes, we will count these as dishes he can try.\n   Dishes with fresh mangoes Oliver can try = 2\n\nNow, we subtract the remaining dishes with fresh mangoes Oliver can't try from the total number of dishes with fresh mangoes.\n   Dishes with fresh mangoes Oliver can't try = 6 - 2 = 4\n\n3. Total number of dishes with mango jelly: 1\n\nNow, we can find the total number of dishes Oliver won't eat by adding the number of dishes with mango salsa, the number of dishes with fresh mangoes he can't try, and the number of dishes with mango jelly.\n   Total number of dishes Oliver won't eat = 3 + 4 + 1 = 8\n\nTo find the number of dishes left for Oliver, we subtract the number of dishes he won't eat from the total number of dishes.\n   Number of dishes left for Oliver = 36 - 8 = 28\n\n#### 28"], "matched_boxed": ["28", "28"], "ground_truth_answer_raw": "28", "step_by_step": false, "num_responses": 2}
{"sample_idx": 132, "question_id": "gsm8k_132", "document": "", "question": "Harly's animal shelter has 80 dogs. She adopts out 40% of them but then has to take back 5 because of personality conflicts with other dogs in their adopted homes. How many dogs does she have now?", "responses": ["To find out how many dogs Harly has now, we'll break the problem into steps.\n\nStep 1: Calculate 40% of 80 dogs.\n40% of 80 is 0.4 * 80 = 32 dogs.\n\nStep 2: Subtract the adopted dogs from the initial number of dogs.\n80 (initial dogs) - 32 (adopted dogs) = 48 dogs.\n\nStep 3: Add back the 5 dogs that were taken back due to personality conflicts.\n48 (remaining dogs) + 5 (taken back dogs) = 53 dogs.\n\nSo, Harly has 53 dogs now.\n#### 53", "To find out how many dogs Harly has now, we need to follow these steps:\n\n1. First, calculate 40% of 80 dogs, which is the number of dogs adopted out:\n   40% of 80 = (40/100) * 80 = 0.4 * 80 = 32 dogs adopted out\n\n2. Next, subtract the number of dogs adopted out from the total number of dogs:\n   80 - 32 = 48 dogs remaining at the shelter\n\n3. Finally, add back the 5 dogs that Harly had to take back:\n   48 + 5 = 53 dogs now\n\nSo, Harly has 53 dogs now.\n#### 53", "To find the number of dogs Harly has now, let's break it down step by step.\n\nStep 1: Calculate the number of dogs Harly adopts out.\n40% of 80 dogs is (40/100) * 80 = 0.4 * 80 = 32 dogs.\n\nStep 2: Determine the number of dogs left after adoption.\n80 (initial dogs) - 32 (adopted dogs) = 48 dogs.\n\nStep 3: Add back the dogs Harly took back due to personality conflicts.\n48 (remaining dogs) + 5 (dogs taken back) = 53 dogs.\n\nTherefore, Harly now has 53 dogs. \n\n#### 53", "To find the number of dogs Harly has now, we need to follow the given steps:\n\n1. Calculate 40% of 80 (number of dogs initially):\n   40% of 80 = 0.4 * 80 = 32\n\n   So, Harly adopts out 32 dogs.\n\n2. Subtract the adopted dogs from the initial number of dogs:\n   80 (initial dogs) - 32 (adopted dogs) = 48\n\n   Harly now has 48 dogs.\n\n3. Harly has to take back 5 dogs, so add these to the current number of dogs:\n   48 (current dogs) + 5 (dogs taken back) = 53\n\nTherefore, Harly now has 53 dogs. \n\n#### 53"], "matched_boxed": ["53", "53", "53", "53"], "ground_truth_answer_raw": "53", "step_by_step": false, "num_responses": 4}
{"sample_idx": 888, "question_id": "gsm8k_888", "document": "", "question": "Matthew, Patrick and Alvin are eating dinner together. Matthew eats three times as many egg rolls as Patrick eats. Patrick eats half as many egg rolls as Alvin eats. If Alvin ate 4 egg rolls, how many did Matthew eat?", "responses": ["To find out how many egg rolls Matthew ate, we need to find out how many Patrick ate first, then multiply it by 3.\n\nGiven that Alvin ate 4 egg rolls and Patrick ate half as many as Alvin, we can find out how many Patrick ate:\nPatrick ate = 4 / 2 = 2\n\nSince Matthew eats three times as many egg rolls as Patrick eats, we can find out how many Matthew ate:\nMatthew ate = 3 * 2 = 6\n\nTherefore, the answer is:\n#### 6", "To find out how many egg rolls Matthew ate, we need to follow the given information step by step:\n\n1. Alvin ate 4 egg rolls.\n2. Patrick eats half as many egg rolls as Alvin eats. So, Patrick ate 4 / 2 = 2 egg rolls.\n3. Matthew eats three times as many egg rolls as Patrick eats. So, Matthew ate 3 * 2 = 6 egg rolls.\n\n#### 6", "To find the number of egg rolls Matthew ate, we need to start from Alvin's consumption and work our way backward.\n\nGiven that Alvin ate 4 egg rolls, we know Patrick ate half as many as Alvin. \n\nPatrick's egg rolls = Alvin's egg rolls / 2\nPatrick's egg rolls = 4 / 2\nPatrick's egg rolls = 2\n\nWe also know Matthew ate three times as many egg rolls as Patrick. \n\nMatthew's egg rolls = 3 * Patrick's egg rolls\nMatthew's egg rolls = 3 * 2\nMatthew's egg rolls = 6\n\n#### 6", "To solve this problem, let's break it down step by step.\n\n1. We are given that Alvin ate 4 egg rolls.\n2. Since Patrick eats half as many egg rolls as Alvin eats, we can calculate the number of egg rolls Patrick ate: \n   4 (Alvin's egg rolls) / 2 = 2 egg rolls\n\n3. Now, we know that Matthew eats three times as many egg rolls as Patrick eats. \n   So, we can calculate the number of egg rolls Matthew ate: \n   3 * 2 (Patrick's egg rolls) = 6 egg rolls\n\nTherefore, the number of egg rolls Matthew ate is 6.\n\n#### 6"], "matched_boxed": ["6", "6", "6", "6"], "ground_truth_answer_raw": "6", "step_by_step": false, "num_responses": 4}
{"sample_idx": 304, "question_id": "gsm8k_304", "document": "", "question": "Daisy is a poodle puppy who loves to play with her dog toys. She often loses them in various ways, and her owner needs to replace them. On Monday, Daisy played with 5 dog toys. On Tuesday, Daisy had 3 dog toys left after losing some, and her owner went to the store and got her 3 more. On Wednesday, all of Daisy's old and new dog toys were missing, so her owner went to the store and bought her 5 more. If Daisy's owner found all the lost dog toys, including the new dog toys, how many dog toys would Daisy have now?", "responses": ["To find out how many dog toys Daisy would have if her owner found all the lost dog toys, including the new ones, let's analyze the situation step by step:\n\n1. Monday: Daisy had 5 dog toys.\n2. Tuesday: After losing some dog toys, Daisy had 3 left. Since her owner got her 3 more, she had 3 (old) + 3 (new) = 6 dog toys.\n3. Wednesday: All her dog toys went missing, but her owner bought her 5 more. This time, Daisy has 5 new dog toys.\n\nNow, let's combine the dog toys that Daisy had before and the ones her owner found. Daisy had 5 old dog toys that went missing, and her owner bought her 5 new ones on Wednesday. On Tuesday, her owner bought her 3 new dog toys. So, the total number of new dog toys is 3 + 5 = 8.\n\nAdding the old dog toys to the new ones, we get: 5 (old) + 8 (new) = 13 dog toys.\n\n#### 13"], "matched_boxed": ["13"], "ground_truth_answer_raw": "13", "step_by_step": false, "num_responses": 1}
{"sample_idx": 589, "question_id": "gsm8k_589", "document": "", "question": "It takes 40 minutes to freeze ice cubes and 3 minutes per smoothie to turn them into smoothies once they're frozen. How long does it take to make 5 smoothies?", "responses": ["To find the total time, we need to calculate the time to freeze the ice cubes and the time to turn them into smoothies.\n\nTime to freeze the ice cubes: 40 minutes (this needs to be done only once, so we can use it as a constant value)\nTime to turn ice cubes into 5 smoothies: 3 minutes per smoothie\nTotal number of smoothies: 5\n\nTime to turn ice cubes into 5 smoothies = 3 minutes per smoothie * 5 smoothies = 15 minutes\n\nTotal time to make 5 smoothies = Time to freeze the ice cubes + Time to turn ice cubes into 5 smoothies\nTotal time to make 5 smoothies = 40 minutes + 15 minutes\nTotal time to make 5 smoothies = 55 minutes\n\n#### 55"], "matched_boxed": ["55"], "ground_truth_answer_raw": "55", "step_by_step": false, "num_responses": 1}
{"sample_idx": 982, "question_id": "gsm8k_982", "document": "", "question": "Vivian is responsible for making sure her students get 2 15-minute recess breaks a day, a 30-minute lunch and another 20-minute recess break.  How much time do her students spend outside of class?", "responses": ["To find the total time spent outside of class, we need to add up the time for each break. \n\n1. Two 15-minute recess breaks: \n   Time for two 15-minute breaks = 2 * 15 = 30 minutes\n\n2. 30-minute lunch: \n   Time for lunch = 30 minutes\n\n3. Another 20-minute recess break: \n   Time for the third recess break = 20 minutes\n\nNow, we add up the time for each break:\nTotal time spent outside of class = 30 + 30 + 20 = 80 minutes\n\n#### 80", "To find the total time spent outside of class, we need to add up the individual times.\n\n- 2 * 15-minute recess breaks = 2 * 15 = 30 minutes\n- 30-minute lunch = 30 minutes\n- 20-minute recess break = 20 minutes\n\nTotal time spent outside of class = 30 + 30 + 20\n= 80 minutes\n\n#### 80", "To find the total time spent outside of class, we need to calculate the total time for recess breaks and lunch.\n\n1. Two 15-minute recess breaks: \n   - Total time for two 15-minute breaks = 2 * 15 minutes\n   - Total time for two 15-minute breaks = 30 minutes\n\n2. 30-minute lunch break: \n   - This is already given in minutes.\n\n3. Another 20-minute recess break:\n   - This is already given in minutes.\n\nNow, add the total time for recess breaks and lunch:\n- Total time spent outside of class = 30 minutes + 30 minutes + 20 minutes\n- Total time spent outside of class = 80 minutes\n\nTherefore, the total time spent outside of class is:\n#### 80", "To find the total time the students spend outside of class, we need to add up the time spent on recess breaks and lunch.\n\n1. Two 15-minute recess breaks: \n   15 minutes * 2 = 30 minutes\n\n2. 30-minute lunch: \n   No conversion needed, it's already in minutes.\n\n3. Another 20-minute recess break: \n   No conversion needed, it's already in minutes.\n\nNow, let's add up the time spent on recess breaks and lunch:\n30 minutes (two 15-minute recess breaks) + 30 minutes (30-minute lunch) + 20 minutes (another 20-minute recess break)\n= 30 + 30 + 20\n= 80 minutes\n\nThe students spend 80 minutes outside of class.\n\n#### 80"], "matched_boxed": ["80", "80", "80", "80"], "ground_truth_answer_raw": "80", "step_by_step": false, "num_responses": 4}
{"sample_idx": 776, "question_id": "gsm8k_776", "document": "", "question": "A magician has a top hat with 20 red marbles and a top hat with 30 blue marbles. If he takes away 3 red marbles and four times as many blue marbles as red marbles (without looking), how many marbles in total does he have left?", "responses": ["To find the total number of marbles left, we first need to calculate the number of marbles taken away from each top hat.\n\nInitially, the magician has 20 red marbles and 30 blue marbles.\n\nThe magician takes away 3 red marbles. \n\nNumber of red marbles left = 20 - 3 = 17\n\nHe takes away four times as many blue marbles as red marbles. Four times the number of red marbles taken is 4 * 3 = 12. \n\nNumber of blue marbles taken away = 12\n\nNumber of blue marbles left = 30 - 12 = 18\n\nTo find the total number of marbles left, we need to add the remaining red and blue marbles.\n\nTotal marbles left = 17 + 18 = 35\n\n#### 35", "To solve this problem, we need to calculate the initial total number of marbles and then subtract the marbles taken away.\n\nInitial red marbles: 20\nInitial blue marbles: 30\nInitial total marbles: 20 + 30 = 50\n\nRed marbles taken away: 3\nBlue marbles taken away: 4 times the number of red marbles = 4 * 3 = 12\n\nTotal marbles taken away: 3 (red) + 12 (blue) = 15\n\nTotal marbles left: Initial total marbles - Total marbles taken away\n= 50 - 15\n= 35\n\n#### 35"], "matched_boxed": ["35", "35"], "ground_truth_answer_raw": "35", "step_by_step": false, "num_responses": 2}
{"sample_idx": 278, "question_id": "gsm8k_278", "document": "", "question": "Tom originally was only able to lift 80  kg farmer handles per hand.  After some training, he was able to double this number.  He then decided to specialize and was able to get an extra 10%.  How much weight can he hold in total?", "responses": ["To find the total weight Tom can hold, we'll break it down step by step:\n\n1. Tom originally lifted 80 kg per hand. \n   Since he can lift the same amount with both hands, we'll consider this as the total weight: \n   80 kg * 2 = 160 kg.\n\n2. After training, Tom was able to double this number: \n   160 kg * 2 = 320 kg.\n\n3. He then got an extra 10% by specializing. \n   To find the extra weight, we multiply 320 kg by 0.10:\n   320 kg * 0.10 = 32 kg.\n\n4. We add the extra weight to the doubled weight to find the total:\n   320 kg + 32 kg = 352 kg.\n\nSo, the total weight Tom can hold is '#### 352'.", "Let's break down the problem step by step:\n\n1. Tom originally could lift 80 kg per hand. To find the total weight he could lift with both hands, we multiply this by 2:\n\n   80 kg/hand * 2 hands = 160 kg\n\n2. After training, Tom was able to double this number. To find the new total weight, we multiply by 2:\n\n   160 kg * 2 = 320 kg\n\n3. He then decided to specialize and was able to get an extra 10% more than the new total. To find 10% of 320 kg, we multiply by 0.1:\n\n   320 kg * 0.1 = 32 kg\n\n4. Now, we need to add this extra weight to the previous total to find the new total weight:\n\n   320 kg + 32 kg = 352 kg\n\nTherefore, the total weight Tom can hold is:\n\n#### 352"], "matched_boxed": ["352'.", "352"], "ground_truth_answer_raw": "352", "step_by_step": false, "num_responses": 2}
{"sample_idx": 162, "question_id": "gsm8k_162", "document": "", "question": "Johnny buys 15 packs of colored pencils for his class. Each pack has a red, yellow, and green pencil inside. When he gets home he notices that 3 of the packs have two extra red pencils inside. How many red colored pencils did Johnny buy?", "responses": ["To find the total number of red pencils, we first need to determine the number of red pencils in the regular packs and the additional red pencils in the 3 special packs.\n\n1. Each pack of regular pencils contains 1 red pencil. \n2. Since there are 15 packs, the total number of red pencils in the regular packs is: 15 * 1 = 15.\n\n3. The 3 special packs contain 2 extra red pencils each. \n4. The total number of additional red pencils is: 3 * 2 = 6.\n\nNow, we add the total number of red pencils in the regular packs and the special packs: \n15 + 6 = 21.\n\n#### 21", "To find the total number of red pencils, we first need to find the total number of red pencils in the standard packs and then add the extra red pencils.\n\n1. Each standard pack has 1 red pencil. Since Johnny bought 15 standard packs, he has 15 * 1 = 15 red pencils from the standard packs.\n\n2. In 3 packs, there are 2 extra red pencils. So, the total extra red pencils are 3 * 2 = 6.\n\n3. To find the total number of red pencils, we add the red pencils from the standard packs and the extra red pencils: 15 + 6 = 21.\n\n#### 21"], "matched_boxed": ["21", "21"], "ground_truth_answer_raw": "21", "step_by_step": false, "num_responses": 2}
